//^ fs ნიშნავს File System
//& ეს მოდული გაძლევს საშუალებას, რომ Node.js-იდან იმუშაო ფაილებთან და საქაღალდეებთან — წაიკითხო, შექმნა, შეცვალო ან წაშალო ფაილები.


//^ fs.readFile() არის ასინქრონული მეთოდი.
//& ეს ნიშნავს, რომ როცა ამ მეთოდით კითხულობ ფაილს, პროგრამა არ ჩერდება — ის აგრძელებს სხვა კოდის შესრულებას, სანამ ფაილი ჩაიტვირთება.
//& როცა ფაილი მზად იქნება, შედეგი უბრუნდება callback ფუნქციით.
//& ამიტომ ეს მეთოდი სასარგებლოა მაშინ, როცა აპლიკაცია მუშაობს ბევრ ფაილთან ან ასრულებს სხვა ამოცანებს პარალელურად (მაგალითად, ვებ-სერვერში).

//^ ხოლო fs.readFileSync() არის სინქრონული მეთოდი.
//& ამ შემთხვევაში პროგრამა ჩერდება იქამდე, სანამ ფაილი ბოლომდე არ ჩაიტვირთება.
//& ანუ სანამ ფაილი არ წავიკითხეთ, შემდეგი ხაზები არ შესრულდება.
//& ამიტომ ეს მეთოდი არ არის რეკომენდებული დიდი პროექტებისთვის, სადაც საჭიროა მაღალი სიჩქარე და არ უნდა ბლოკირდებოდეს პროგრამა.


//^ fs.writeFile() არის ასინქრონული მეთოდი.
//& ეს ნიშნავს, რომ როცა ამ მეთოდით ფაილში წერ მონაცემს, პროგრამა არ ჩერდება — ის აგრძელებს სხვა კოდის შესრულებას, სანამ ჩაწერა დასრულდება.
//& როდესაც ფაილი ჩაიწერება, შედეგი ბრუნდება callback ფუნქციით.
//& ასეთი მიდგომა უფრო ეფექტურია მაშინ, როცა აპლიკაცია ასრულებს ბევრ ამოცანას ერთდროულად (მაგალითად, სერვერი რომელიც ერთდროულად ბევრ მომხმარებელს ემსახურება).

//^ ხოლო fs.writeFileSync() არის სინქრონული მეთოდი.
//& ამ შემთხვევაში, პროგრამა ჩერდება და ელოდება სანამ ფაილი ბოლომდე ჩაიწერება.
//& სანამ ჩაწერა არ დასრულდება, შემდეგი კოდი არ შესრულდება.
//& ამიტომ ეს მეთოდი მარტივ სკრიპტებშია მოსახერხებელი, მაგრამ დიდ პროექტებში შეიძლება შეაფერხოს სიჩქარე, რადგან ბლოკავს სხვა ოპერაციებს.


const fs = require('node:fs')
function readFileContent(path){
    fs.readFile(path, 'utf8', (err, data) => {
        if(err){
            console.error(err);
            return;
        }
        console.log(data);
    })
}
readFileContent('./task04.txt');


function writeToFile(path, content){
    fs.writeFile(path, content, err => {
        if(err){
            console.log(err);
            return;
        }
        console.log('File writing ended!(Task 05)');
    })
}
writeToFile('./task05.txt', 'Hello, World!');


const process = require('node:process');
let argument = process.argv.slice(2).join(' ');
fs.writeFile('./text.txt', argument, err => {
    if(err){
        console.error(err);
        return;
    }
    console.log('File writing ended(Task 06)');

    fs.appendFile('./text.txt', '\nNew line!', err => {
        if(err){
            console.error(err);
            return;
        }
        console.log('New Line added!(Task 07)');
    })

    fs.readFile('./text.txt', 'utf8', (err, data) => {
        if(err){
            console.error(err);
            return;
        }
        console.log(data);
    })
})