#* Big O ნოტაცია გამოიყენება იმისათვის, რომ ავხსნათ
#* ალგორითმის ეფექტურობა/სირთულე დროისა და მეხსიერების მიმართ.
#* ის გვიჩვენებს როგორ იზრდება ალგორითმის მუშაობის დრო ან რესურსების მოხმარება
#* შესატანი მონაცემების რაოდენობის ზრდასთან ერთად.

#* O(1) – კონსტანტური სირთულე
#* ალგორითმი ყოველთვის ერთსა და იმავე დროში სრულდება,
#* მიუხედავად მონაცემების ზომისა.
#* მაგალითად: მასივის კონკრეტულ ინდექსზე ელემენტის წაკითხვა.

#* O(n) – ხაზოვანი სირთულე
#* ალგორითმის შესრულების დრო პირდაპირ პროპორციულია
#* მონაცემების რაოდენობას.
#* მაგალითად: მასივში ყველა ელემენტის გადავლა ერთ ციკლში.

#* O(n**2) – კვადრატული სირთულე
#* ალგორითმის დრო იზრდება მონაცემების ზომის კვადრატის მიხედვით.
#* ხშირად გვხვდება ორმაგ ციკლში (მაგ: მასივის ყველა ელემენტის შედარება ერთმანეთთან).