// სტატიკური:
//   სტატიკური მასივის ზომა თავიდანვე არის განსაზღვრული და არ იცვლება

//   მახასიათებლები:
//       1. ზომა არ იცვლება
//       2. ელემენტებზე წვდომა ძალიან სწრაფია

//   უპირატესობები:
//       1. მარტივად გამოიყენება
//       2. ნაკლები მეხსიერება ჭირდება

// დინამიური:
//   დინამიური მასივის შეცვლა შეიძლება მაგრამ ელემენტზე წვდომა შეიძლება ნელი იყოს და მეხსიერების მართვა უფრო რთულია

//   მახასიათებლები:
//       1. ზომა შეიძლება გაიზარდოს ან შემცირდეს

//   უპირატესობები:
//       1. ძალიან მოქნილია
//       2. ნაკლები მეხსიერება ჭირდება